** call-process
   What's the difference from the =shell-command=. =start-process= is aync.

   This will be freezed because the process will not stop.
   #+BEGIN_SRC elisp
     (let ((buffer "*test-git*"))
       (call-process "ping" nil buffer nil "google.com")
       (switch-to-buffer buffer))
   #+END_SRC


   This will be ok.
   #+BEGIN_SRC elisp
     (let ((buffer "*test-git*"))
       (start-process "git" buffer "ping" "google.com")
       (switch-to-buffer buffer))
   #+END_SRC

   #+RESULTS:
   : #<buffer *test-git*>

*** basic transient
    #+begin_src elisp
      (defun just-echo ()
        (interactive)
        (message "hello"))

      (define-transient-command test-transient ()
        "This is the doc"
        ["Action"
         ("a" "Action a" just-echo)
         ("s" "Action a" just-echo)
         ("d" "Action a" just-echo)])

      (test-transient)
    #+end_src

    #+RESULTS:
    | transient--resume-which-key-mode |

*** transient with switches

    #+begin_src elisp
      (defun just-echo (&optional args)
        (interactive (list (transient-args 'test-transient)))
        (message "args: %s" args))

      (define-transient-command test-transient ()
        "This is the doc"
        ["Arguments"
         ("-s" "Switch" "--switch")
         ("-a" "Annotate" "--annotate")]
        ["Action"
         ("a" "Action a" just-echo)
         ("s" "Action a" just-echo)
         ("d" "Action a" just-echo)])

      (test-transient)
    #+end_src

    #+RESULTS:
    | transient--resume-which-key-mode |

*** transient with params

    #+begin_src elisp
      (defun just-echo (&optional args)
        (interactive (list (transient-args 'test-transient)))
        (message "args: %s" args))

      (define-infix-argument test-transient:--message ()
        :description "Messages"
        :class 'transient-option
        :shortarg "-m"
        :argument "--message=")

      (define-transient-command test-transient ()
        "This is the doc"
        ["Arguments"
         ("-s" "Switch" "--switch")
         ("-a" "Annotate" "--annotate")
         (test-transient:--message)]
        ["Action"
         ("a" "Action a" just-echo)
         ("s" "Action a" just-echo)
         ("d" "Action a" just-echo)])

      (test-transient)

    #+end_src

    #+RESULTS:
    | transient--resume-which-key-mode |

